[{"name":"welcome","ua":"Перевір - інформаційний бот для перевірки даних та повідомлення сумнівних новин.\n\nПовідомляй дані, які хочеш перевірити:\n-пости в соціальних мережах\n-посилання\n-медіафайли або фото\n\nЦей контент перевіриться вручну та алгоритмами і ми дамо тобі відповідь.\n\nПеревіряють інформацію журналісти @gwaramedia, медіаволонтери та громадські активісти.","en":"PEREVIRKA - an information bot for reporting suspicious or fake stories on Ukraine from worldwide.\n\nReport the data you want to verify:\n- posts on social networks\n- links\n- media files or photos\n\nThis content will be tested manually and by algorithms and we will give you an answer.\n\nJournalists of @gwaramedia and media volunteers-fact-checkers verify your requests.","rows":5,"description":"/start"},{"name":"check_content","ua":"Надішліть матеріали, які бажаєте перевірити","en":"Submit the materials you would like to check","rows":1,"description":"Перевірити контент"},{"name":"black_source","ua":"Високовірогідно - ФЕЙК, МАНІПУЛЯЦІЯ або ДЕЗІНФОРМАЦІЯ. Запит не перевірявся журналістами та фактчекерами і обробився автоматично.","en":"Most likely - FAKE, MANIPULATION or DISINFORMATION. The request was not checked by journalists and fact-checkers and was processed automatically by our rank system ","rows":2,"description":"Джерело запиту у чорному списку"},{"name":"white_source","ua":"Високовірогідно - ВІДПОВІДАЛЬНА ІНФОРМАЦІЯ або ПРАВДА. Запит не перевірявся журналістами та фактчекерами і обробився автоматично.","en":"Most likely - TRUTH. The request was not checked by journalists and fact-checkers and was processed automatically by our rank system ","rows":2,"description":"Джерело запиту у білому списку"},{"name":"new_requests","ua":"Ми нічого не знайшли або не бачили такого. Почали опрацьовувати цей запит\n\nЗ початком війни журналісти @gwaramedia запустила бот для перевірки новин на фейки — @perevir_bot\n\nНам надходить дуууже багато повідомлень. Тому відповіді можуть сильно затримуватись.\n\nМи дуже раді, що ви не вірите всьому, що гуляє в мережі, і надсилаєте інфо на перевірку, але нам потрібні додаткові руки. \n\nЯкщо хочеш стати бійцем інфо фронту — заповнюй анкету за лінком:\nhttps://bit.ly/3Cilv7a","en":"We didn't find or see anything like that in our database. This request should be processed by journalists within 24 hours","rows":5,"description":"Прийняли запит в обробку"},{"name":"request_reason","ua":"Чому важливо перевірити цю інформацію?","en":"Why would you like to check this information?","rows":1,"description":"Причина подачі запита після надсилання"},{"name":"unsupported_request","ua":"Ми поки не обробляємо даний тип звернення.\n\nЯкщо ви хочете поділитись даною інформацією, надішліть на пошту hello@gwaramedia.com з темою ІНФОГРИЗ_Тема_Контекст про що мова. \n\nДодайте якомога більше супроводжуючої інформації:\n- дата матеріалів\n- локація\n- чому це важливо\n- для кого це\n\nЯкщо це важкі файли, краще завантажити їх в клауд з постійним зберіганням і надіслати нам посилання.","en":"Unsupported reason of the request","rows":5,"description":"Якщо повідомлення не текст/відео/фото"},{"name":"stopped_requests","ua":"Ми тимчасово призупинили прийом повідомлень. Спробуйте знову за деякий час.","en":"We have temporarily suspended the reception of messages for maintenance. Please try again in a while.","rows":2,"description":"Якщо виключити прийом повідомлень"},{"name":"waitlist","ua":"Команда вже обробляє даний запит. Повідомимо про результат згодом","en":"The team is already processing this request. We will send the result later","rows":1,"description":"Якщо повтоорно надсилають запит, який вже у базі"},{"name":"true_status","ua":"Ваше звернення визначено як правдиве","en":"Your request has been identified as true","rows":2,"description":"Запит визначили як ПРАВДА"},{"name":"manipulation_status","ua":"Дана інформація визначено як маніпуляцію. Частково викладені дані можуть бути правдивими, проте вони вирвані з контексту або ж викладені таким чином, що наштовхують на невірні висновки","en":"This information is a manipulation, which might be partially true but was taken out of context or presented in such a way that makes you make wrong conclusions","rows":4,"description":"Запит визначили як МАНІПУЛЯЦІЯ"},{"name":"noproof_status","ua":"На даний час ця інформація отримана лише з одного не надто надійного джерела, тому поки неможливо визначити її достовірність","en":"Currently this information was received from single untrusted source which is not enough to prove it true or fake","rows":3,"description":"Запит відхилений через брак підтверджень"},{"name":"fake_status","ua":"Ця новина є фейком","en":"Your request has been identified as fake","rows":2,"description":"Запит визначили як ФЕЙК"},{"name":"reject_status","ua":"🌪На жаль, ми не можемо підтвердити чи спростувати цю інформацію🌪\n\nВірогідні причини:\n🧨 перевантаження\nми мали пікове навантаження в момент твого запиту і він застарів\n🔧нерелевантний запит\nми перевіряємо інформацію на фейки, проте інколи читачі плутають це з консьєрж-сервісом\n\nЗ початком війни журналісти @gwaramedia запустили цей бот для перевірки новин на фейки.\nІнформація перевіряється журналістами, волонтерами (громадськими фактчекерами) та алгоритмами.\n\nНадсилайте важливу інформацію на перевірку - зробимо інфопростір чистим.","en":"🌪Unfortunately, we are not ready to confirm or deny this information🌪\n\nProbable causes:\n🧨 overload\nwe had a peak load at the time of your request and it is out of date\n🔧 irrelevant request\nwe check the information for fakes, but sometimes readers confuse this with concierge service","rows":5,"description":"Запит визначили як ВІДМОВА"},{"name":"interest_request","ua":"На жаль, ми не обробляємо запити із такою причиною звернення.","en":"Unfortunately, we do not process requests for this reason.","rows":1,"description":"Причина звернення ЦІКАВО"},{"name":"timeout_request","ua":"Дякуємо за Ваше звернення! \nНа жаль, на цей час навантаження на бот дуже велике і оскільки обробка запитів здійснюється вручну командою фактчекерів-волонтерів, ми не встигаємо обробити все вчасно. \nПриносимо наші вибачення.\n\nЯкщо Ваш запит ще актуальний та необхідний, будь ласка, надішліть його повторно. Просимо нам направляти інформацію, яка містить: текст/фото та джерело каналу. Запити-пропозиції з роботи, волонтерства або інших питань з приватних номерів та каналів, ми не можемо ніяк перевірити. Тому радимо звертатися до відповідних установ, які цим займаються та бути пильними!\nЩоб бути обізнаними та не піддаватися фейкам — підписуйтеся на офіційні канали, які одними з перших повідомляють важливу інформацію:\n✅https://t.me/OP_UA\nhttps://www.facebook.com/president.gov.ua — Офіс президента України\n✅ https://t.me/V_Zelenskiy_official — Президент України Володимир Зеленський.\n✅https://www.facebook.com/KabminUA — Кабінет Міністрів України\n✅https://www.facebook.com/MinistryofDefence.UA — Міністерство оборони України\n✅https://www.facebook.com/GeneralStaff.ua — Генеральний штаб Збройних сил України\n✅https://t.me/CenterCounteringDisinformation — Центр протидії дезінформації при РНБО","en":"Thank you for your request!\nUnfortunately, at this time the load on the bot is very high and because the processing of requests is done manually by a team of fact-checking volunteers, we do not have time to process everything in time.\nWe apologize.\n\nIf your request is still relevant and necessary, please resubmit it.","rows":5,"description":"Не встигли обробити запит"},{"name":"change_lang","ua":"Мову успішно змінено","en":"Language is changed successfully","rows":1,"description":"При зміні мови"},{"name":"request_escalated","ua":"Ваше звернення містить дані, які потребують дещо глибшої перевірки, це може зайняти трохи більше часу ніж перевірка звичайного запиту. Дякуємо за очікування","en":"Your request contains facts that require a deeper check this might be a bit longer than a regular request. Your request escalated to the team - it could take up to 1 week. Thank you for your submission.","rows":"4","description":"Запит ескальовано"},{"name":"open_chat","ua":"З метою уточнення даних по вашому запиту до цього чату підключиться фактчекер","en":"In order to clarify the data on your request, a factchecker will be connected to the chat","rows":"1","description":"Відкриття діалогу"},{"name":"close_chat","ua":"Фактчекер завершив діалог","en":"Factchecker ended the dialogue","rows":"1","description":"Закриття діалогу"}, {"name": "throttling", "ua": "Ви перевищили ліміт запитів. Відпочиньте і спробуйте пізніше.", "en": "You have exceeded the request limit, please wait and try again later.", "rows": "1", "description": "Перевищення ліміту запитів"}]