const CheckContentText = "Перевірити контент"
const SubscribtionText = "🔥 Актуальні фейки"
const NoCurrentFakes = "Нажаль ми ще не підібрали для вас актуальних фейків"
const SetFakesRequestText = "Надішліть нові фейки у відповідь на це повідомлення"
const TrueMessageText = "Ваше звернення визначено як правдиве"
const FakeMessageText = "Ваше звернення визначено як оманливе"
const RejectMessageText = "🌪На жаль, ми не можемо підтвердити чи спростувати цю інформацію🌪\n\nВірогідні причини:\n🧨 перевантаження\nми мали пікове навантаження в момент твого запиту і він застарів\n🔧нерелевантний запит\nми перевіряємо інформацію на фейки, проте інколи читачі плутають це з консьєрж-сервісом\n\nЗ початком війни журналісти @gwaramedia запустили цей бот для перевірки новин на фейки.\nІнформація перевіряється журналістами, волонтерами (громадськими фактчекерами) та алгоритмами.\n\nНадсилайте важливу інформацію на перевірку - зробимо інфопростір чистим."
const AutoResponseClickbait = "Дякуємо за звернення!\n\nЦе так званий клікбейт – заголовок, що спонукає вас перейти за посиланням, приєднатися до каналу, завантажити додаток, тощо.\n\nКеруйтеся здоровим глуздом та залишайтеся в безпеці.\nВсе буде Україна💛💙"
const AutoResponseZeroInfo = "Дякуємо за звернення!\n\nПеревірка запитів здійснюється вручну командою спеціалістів, тому, будь ласка, надсилайте запити, що містять тільки конкретні факти для перевірки.\n\nКеруйтеся здоровим глуздом та не піддавайтесь паніці!\n\nЗалишайтеся в безпеці\nВсе буде Україна💛💙"
const AutoResponseHelpRequest = "Дякуємо за звернення!\n\nНа жаль, ми не можемо підтвердити або спростувати цю інформацію. \nЗастерігаємо! Перед тим як поширити або відгукнутися на запит про допомогу, переконайтесь, що він надійшов з надійного джерела, або від людини, яку ви знаєте особисто. \n\nДодаємо список надійних організацій, які надають допомогу потерпілим:\n\n📍Запити на потреби в донорах крові:\n@donorua\n\n📍Бот, який шукає людей, які готові тимчасово прихистити дитину: @dytyna_ne_sama_bot\n\n📍Канал, який публікує різні перевірені запити про допомогу: \n@VolunteerCountry\n\n📍Чати міст: https://docs.google.com/document/d/13b2N646bdPT18kb49fUrRdqb91286BoLdbaC2pMww5k/mobilebasic\n\n📍Оперативники Департаменту кіберполіції:\n@ukraine_avanger_bot.\n\n📍Бот СБУ для повідомлення про ворожу техніку (оброблюється в ручному режимі, самі кажуть що перевантажені): \n@stop_russian_war_bot\n\n📍Бот від Кіберполіції для блокування сервісів дезінформації (https://t.me/CyberpolUA/1038):\n@stopdrugsbot\n\n📍Чат-бот для підтримки громадян в евакуації:\n@shelter_for_ukrainians_bot\n\n📍«Друг. Перша допомога» – телеграм-бот першої психологічної допомоги:\n@friend_first_aid_bot\n\nКеруйтеся здоровим глуздом та не поширюйте неперевірену інформацію.\nВсе буде Україна💛💙"
const AutoResponseMap = {
    "1": "клікбейт",
    "2": "неінформативний запит",
    "3": "прохання про допомогу"
}

module.exports = {
    CheckContentText,
    SubscribtionText,
    SetFakesRequestText,
    NoCurrentFakes,
    TrueMessageText,
    FakeMessageText,
    RejectMessageText,
    AutoResponseClickbait,
    AutoResponseZeroInfo,
    AutoResponseHelpRequest,
    AutoResponseMap
}
