const CheckContentText = "Перевірити контент"
const CheckContentAnswerText= "Надішліть матеріали які бажаєте перевірити"
const SubscribtionText = "🔥 Актуальні фейки"
const NoCurrentFakes = "Нажаль ми ще не підібрали для вас актуальних фейків"
const SetFakesRequestText = "Надішліть нові фейки у відповідь на це повідомлення"
const TrueMessageText = "Ваше звернення визначено як правдиве"
const FakeMessageText = "Ваше звернення визначено як оманливе"
const RejectMessageText = "🌪На жаль, ми не можемо підтвердити чи спростувати цю інформацію🌪\n\nВірогідні причини:\n🧨 перевантаження\nми мали пікове навантаження в момент твого запиту і він застарів\n🔧нерелевантний запит\nми перевіряємо інформацію на фейки, проте інколи читачі плутають це з консьєрж-сервісом\n\nЗ початком війни журналісти @gwaramedia запустили цей бот для перевірки новин на фейки.\nІнформація перевіряється журналістами, волонтерами (громадськими фактчекерами) та алгоритмами.\n\nНадсилайте важливу інформацію на перевірку - зробимо інфопростір чистим."
const BlackSourceText = "Високовірогідно - ФЕЙК, МАНІПУЛЯЦІЯ або ДЕЗІНФОРМАЦІЯ. Запит не перевірявся журналістами та фактчекерами і обробився автоматично.";
const WhiteSourceText = "Високовірогідно - ВІДПОВІДАЛЬНА ІНФОРМАЦІЯ або ПРАВДА. Запит не перевірявся журналістами та фактчекерами і обробився автоматично.";
const ForbiddenRequestText = "Ми тимчасово призупинили прийом повідомлень. Спробуйте знову за деякий час.";
const TimeoutMessageText = "Дякуємо за Ваше звернення! \nНа жаль, на цей час навантаження на бот дуже велике і оскільки обробка запитів здійснюється вручну командою фактчекерів-волонтерів, ми не встигаємо обробити все вчасно. \nПриносимо наші вибачення.\n\nЯкщо Ваш запит ще актуальний та необхідний, будь ласка, надішліть його повторно. Просимо нам направляти інформацію, яка містить: текст/фото та джерело каналу. Запити-пропозиції з роботи, волонтерства або інших питань з приватних номерів та каналів, ми не можемо ніяк перевірити. Тому радимо звертатися до відповідних установ, які цим займаються та бути пильними! \n" +
    "Щоб бути обізнаними та не піддаватися фейкам — підписуйтеся на офіційні канали, які одними з перших повідомляють важливу інформацію:  \n" +
    "✅https://t.me/OP_UA\nhttps://www.facebook.com/president.gov.ua — Офіс президента України \n" +
    "✅ https://t.me/V_Zelenskiy_official — Президент України Володимир Зеленський. \n" +
    "✅https://www.facebook.com/KabminUA — Кабінет Міністрів України\n" +
    "✅https://www.facebook.com/MinistryofDefence.UA — Міністерство оборони України\n" +
    "✅https://www.facebook.com/GeneralStaff.ua — Генеральний штаб Збройних сил України\n" +
    "✅https://t.me/CenterCounteringDisinformation — Центр протидії дезінформації при РНБО"
const AutoResponseClickbait = "Дякуємо за звернення!\n\nЦе так званий клікбейт – заголовок, що спонукає вас перейти за посиланням, приєднатися до каналу, завантажити додаток, тощо.\n\nКеруйтеся здоровим глуздом та залишайтеся в безпеці.\nВсе буде Україна💛💙"
const AutoResponseZeroInfo = "Дякуємо за звернення!\n\nПеревірка запитів здійснюється вручну командою спеціалістів, тому, будь ласка, надсилайте запити, що містять тільки конкретні факти для перевірки.\n\nКеруйтеся здоровим глуздом та не піддавайтесь паніці!\n\nЗалишайтеся в безпеці\nВсе буде Україна💛💙"
const AutoResponseHelpRequest = "Дякуємо за звернення!\n\nНа жаль, ми не можемо підтвердити або спростувати цю інформацію.\nЗастерігаємо! Перед тим як поширити або відгукнутися на запит про допомогу, переконайтесь, що він надійшов з надійного джерела, або від людини, яку ви знаєте особисто. \n\nДодаємо список надійних організацій, які надають допомогу потерпілим:\n\n📍Запити на потреби в донорах крові:\n@donorua\n\n📍Бот, який шукає людей, які готові тимчасово прихистити дитину: @dytyna_ne_sama_bot\n\n📍Канал, який публікує різні перевірені запити про допомогу: \n@VolunteerCountry\n\n📍Чати міст: https://docs.google.com/document/d/13b2N646bdPT18kb49fUrRdqb91286BoLdbaC2pMww5k/mobilebasic\n\n📍Оперативники Департаменту кіберполіції:\n@ukraine_avanger_bot.\n\n📍Бот СБУ для повідомлення про ворожу техніку (оброблюється в ручному режимі, самі кажуть що перевантажені): \n@stop_russian_war_bot\n\n📍Бот від Кіберполіції для блокування сервісів дезінформації (https://t.me/CyberpolUA/1038):\n@stopdrugsbot\n\n📍Чат-бот для підтримки громадян в евакуації:\n@shelter_for_ukrainians_bot\n\n📍«Друг. Перша допомога» – телеграм-бот першої психологічної допомоги:\n@friend_first_aid_bot\n\nКеруйтеся здоровим глуздом та не поширюйте неперевірену інформацію.\nВсе буде Україна💛💙"
const AutoResponseNoAccess = "Дякуємо за звернення!\n\nНа жаль, ми не можемо підтвердити чи спростувати дану інформацію (надане Вами посилання недоступне). Керуйтеся здоровим глуздом та не піддавайтесь паніці!\n\nЗалишайтеся в безпеці\nВсе буде Україна💛💙"
const AutoresponseIMHO = "Дякуємо за звернення!\n\nМи робимо перевірку фактів: аналізуємо дані, розшукуємо першоджерела, перевіряємо повідомлення, виявляємо пропаганду та маніпуляції.\n\nДана інформація є оціночним судженням і не є фактами, які можна перевірити.\n\nКеруйтесь здоровим глуздом - все буде Україна! 🥰\nПідвищуй свою медіаграмотність в онлайн-курсі від наших колег."
const AutoResponseTextMap = {
    "1": AutoResponseClickbait,
    "2": AutoResponseZeroInfo,
    "3": AutoResponseHelpRequest,
    "4": AutoResponseNoAccess,
    "5": AutoresponseIMHO
}
const AutoResponseTagMap = {
    "1": "клікбейт",
    "2": "неінформативний запит",
    "3": "прохання про допомогу",
    "4": "посилання недоступне",
    "5": "оціночні судження"
}
const NotifyUserTextMap = {
    "1": TrueMessageText,
    "-1": FakeMessageText,
    "-2": RejectMessageText,
    "-3": TimeoutMessageText
}
const UnsupportedContentText = "Ми не обробляємо переслані повідомлення, проте можете надіслати посилання на інформацію, яку бажаєте перевірити";
const WhatReasonText = "Чому важливо перевірити цю інформацію";
const ByInterestRequestText = "На жаль, ми не обробляємо запити із такою причиною звернення.";
const RequestTimeout = 14 // in days

module.exports = {
    CheckContentText,
    CheckContentAnswerText,
    SubscribtionText,
    SetFakesRequestText,
    NoCurrentFakes,
    TrueMessageText,
    FakeMessageText,
    RejectMessageText,
    BlackSourceText,
    WhiteSourceText,
    ForbiddenRequestText,
    AutoResponseTextMap,
    AutoResponseTagMap,
    UnsupportedContentText,
    WhatReasonText,
    ByInterestRequestText,
    RequestTimeout,
    TimeoutMessageText,
    NotifyUserTextMap
}