const CheckContentText = "Перевірити контент"
const SubscribtionText = "🔥 Актуальні фейки"
const NoCurrentFakes = "Нажаль ми ще не підібрали для вас актуальних фейків"
const SetFakesRequestText = "Надішліть нові фейки у відповідь на це повідомлення"
const TrueMessageText = "Ваше звернення визначено як правдиве"
const FakeMessageText = "Ваше звернення визначено як оманливе"
const RejectMessageText = "🌪На жаль, ми не можемо підтвердити чи спростувати цю інформацію🌪\n\nВірогідні причини:\n🧨 перевантаження\nми мали пікове навантаження в момент твого запиту і він застарів\n🔧нерелевантний запит\nми перевіряємо інформацію на фейки, проте інколи читачі плутають це з консьєрж-сервісом\n\nЗ початком війни журналісти @gwaramedia запустили цей бот для перевірки новин на фейки.\nІнформація перевіряється журналістами, волонтерами (громадськими фактчекерами) та алгоритмами.\n\nНадсилайте важливу інформацію на перевірку - зробимо інфопростір чистим."
const BlackSourceText = "Високовірогідно - ФЕЙК, МАНІПУЛЯЦІЯ або ДЕЗІНФОРМАЦІЯ. Запит не перевірявся журналістами та фактчекерами і обробився автоматично.";
const WhiteSourceText = "Високовірогідно - ВІДПОВІДАЛЬНА ІНФОРМАЦІЯ або ПРАВДА. Запит не перевірявся журналістами та фактчекерами і обробився автоматично.";
const ForbiddenRequestText = "Ми тимчасово призупинили прийом повідомлень. Спробуйте знову за деякий час.";

module.exports = {
    CheckContentText,
    SubscribtionText,
    SetFakesRequestText,
    NoCurrentFakes,
    TrueMessageText,
    FakeMessageText,
    RejectMessageText,
    BlackSourceText,
    WhiteSourceText,
    ForbiddenRequestText
}